tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Distributed revision control system
brew "git"
# GNU grep, egrep and fgrep
brew "grep"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Application uninstaller
cask "appcleaner"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
cask "font-inconsolata"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Collaboration platform for API development
cask "postman"
# Graphical client for Git version control
cask "sourcetree"
