tap "homebrew/bundle"
tap "homebrew/cask-fonts"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Distributed revision control system
brew "git"
# GNU grep, egrep and fgrep
brew "grep"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Application uninstaller
cask "appcleaner"
# Desktop password and login vault
cask "bitwarden"
# Voice and text chat software
cask "discord"
# Web browser
cask "firefox"
cask "font-inconsolata"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Smooths scrolling and set mouse scroll directions independently
cask "mos"
# Collaboration platform for API development
cask "postman"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Graphical client for Git version control
cask "sourcetree"
# JavaScript IDE
cask "webstorm"
vscode "angular.ng-template"
vscode "coenraads.bracket-pair-colorizer"
vscode "cyrilletuzi.angular-schematics"
vscode "davidbabel.vscode-simpler-icons"
vscode "dbaeumer.vscode-eslint"
vscode "doggy8088.angular-extension-pack"
vscode "doggy8088.quicktype-refresh"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "gerane.theme-blackboard"
vscode "gerane.theme-flatlandblack"
vscode "gruntfuggly.todo-tree"
vscode "infinity1207.angular2-switcher"
vscode "johnpapa.angular2"
vscode "krizzdewizz.refactorix"
vscode "mikael.angular-beastcode"
vscode "nhoizey.gremlins"
vscode "nrwl.angular-console"
vscode "octref.vetur"
vscode "oouo-diogo-perdigao.docthis"
vscode "patbenatar.advanced-new-file"
vscode "pranaygp.vscode-css-peek"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "xabikos.javascriptsnippets"
vscode "zamerick.black-ocean"
